In [12]:
import pandas as pd

sample_dict = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}

sandbox = pd.DataFrame.from_dict(sample_dict)

## Properties

In [35]:
print("Index")
print(sandbox.index)
print()
print("Columns")
print(sandbox.columns)
print()
print("Values")
print(sandbox.values)
print()
print("Dtypes")
print(sandbox.dtypes)
print()

print("Dimensions")
print(sandbox.ndim)
print()

print("Shape")
print(sandbox.shape)
print()

Index
RangeIndex(start=0, stop=3, step=1)

Columns
Index(['Name', 'Age', 'City'], dtype='object')

Values
[['Alice' 25 'New York']
 ['Bob' 30 'London']
 ['Charlie' 35 'Paris']]

Dtypes
Name    object
Age      int64
City    object
dtype: object

Dimensions
2

Shape
(3, 3)

## Methods

In [16]:
sandbox['Name'].apply(lambda x: len(x))

0    5
1    3
2    7
Name: Name, dtype: int64

In [17]:
sandbox.apply(lambda x: len(x['Name']), axis = 1)

0    5
1    3
2    7
dtype: int64

In [29]:
for index, row in list(sandbox.iterrows()):
    print(len(row['Name']))

5
3
7

## Selectors

In [25]:
sandbox[sandbox['Name'].isin(['Alice'])]

    Name  Age      City
0  Alice   25  New York

In [36]:
sandbox.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [41]:
sandbox.loc[sandbox['Name'] == 'Alice']

    Name  Age      City
0  Alice   25  New York

## Melting

In [73]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [90, 85, 92],
    'Science': [80, 88, 78],
    'History': [95, 91, 88]
}

df = pd.DataFrame(data)

melted_df = pd.melt(df, id_vars='Name', var_name='Subject', value_name='Score')

melted_df

      Name  Subject  Score
0    Alice     Math     90
1      Bob     Math     85
2  Charlie     Math     92
3    Alice  Science     80
4      Bob  Science     88
5  Charlie  Science     78
6    Alice  History     95
7      Bob  History     91
8  Charlie  History     88

In [76]:
pivot_df = melted_df.pivot(index='Name', columns='Subject', values='Score')

pivot_df

Subject  History  Math  Science
Name
Alice         95    90       80
Bob           91    85       88
Charlie       88    92       78

## Real Case

In [42]:
import pandas as pd

train = pd.read_csv('./train.csv')
test = pd.read_csv('./test.csv')

df = pd.concat([train, test])

In [43]:
df.head()

,row_id,cfips,county,state,first_day_of_month,microbusiness_density,active
0,1001_2019-08-01,1001,Autauga County,Alabama,2019-08-01,3.007682,1249
1,1001_2019-09-01,1001,Autauga County,Alabama,2019-09-01,2.884870,1198
2,1001_2019-10-01,1001,Autauga County,Alabama,2019-10-01,3.055843,1269
3,1001_2019-11-01,1001,Autauga County,Alabama,2019-11-01,2.993233,1243
4,1001_2019-12-01,1001,Autauga County,Alabama,2019-12-01,2.993233,1243

In [44]:
df.describe()

               cfips  microbusiness_density        active
count  122265.000000          122265.000000  1.222650e+05
mean    30376.037640               3.817671  6.442858e+03
std     15143.508721               4.991087  3.304001e+04
min      1001.000000               0.000000  0.000000e+00
25%     18177.000000               1.639344  1.450000e+02
50%     29173.000000               2.586543  4.880000e+02
75%     45077.000000               4.519231  2.124000e+03
max     56045.000000             284.340030  1.167744e+06

## Cleaning Data

In [45]:
basedate = pd.Timestamp('2019-08-01')

df = df.assign(
    timestamp = lambda x: x['row_id'].str.split('_').str[1],
    date = lambda x: pd.to_datetime(x['timestamp']),
    year = lambda x: x['date'].dt.year,
    country_code = lambda x: x['cfips'] // 100,
    state_code = lambda x: x['cfips'] % 100,
    day_of_experiment = lambda x: (x['date'] - basedate),
    population_date = lambda x: x['date'] - pd.DateOffset(years=2),
    population_year = lambda x: x['population_date'].dt.year,
    is_test = lambda x: x['county'].isna()
)

In [46]:
df.columns

Index(['row_id', 'cfips', 'county', 'state', 'first_day_of_month',
       'microbusiness_density', 'active', 'timestamp', 'date', 'year',
       'country_code', 'state_code', 'day_of_experiment', 'population_date',
       'population_year', 'is_test'],
      dtype='object')

## Exploratory Data Analysis

In [60]:
train.head()

,row_id,cfips,county,state,first_day_of_month,microbusiness_density,active
0,1001_2019-08-01,1001,Autauga County,Alabama,2019-08-01,3.007682,1249
1,1001_2019-09-01,1001,Autauga County,Alabama,2019-09-01,2.884870,1198
2,1001_2019-10-01,1001,Autauga County,Alabama,2019-10-01,3.055843,1269
3,1001_2019-11-01,1001,Autauga County,Alabama,2019-11-01,2.993233,1243
4,1001_2019-12-01,1001,Autauga County,Alabama,2019-12-01,2.993233,1243

In [61]:
train.tail()

,row_id,cfips,county,state,first_day_of_month,microbusiness_density,active
122260,56045_2022-06-01,56045,Weston County,Wyoming,2022-06-01,1.803249,101
122261,56045_2022-07-01,56045,Weston County,Wyoming,2022-07-01,1.803249,101
122262,56045_2022-08-01,56045,Weston County,Wyoming,2022-08-01,1.785395,100
122263,56045_2022-09-01,56045,Weston County,Wyoming,2022-09-01,1.785395,100
122264,56045_2022-10-01,56045,Weston County,Wyoming,2022-10-01,1.785395,100

In [59]:
train['county'].value_counts()

Washington County        1170
Jefferson County          975
Franklin County           936
Lincoln County            897
Jackson County            897
                         ...
Androscoggin County        39
Winn Parish                39
West Feliciana Parish      39
West Carroll Parish        39
Weston County              39
Name: county, Length: 1871, dtype: int64

In [68]:
train.groupby(['county'], as_index = False)['county'].count()\
    .sort_values(by='county', ascending=False)

      county
1769    1170
838      975
599      936
984      897
832      897
...      ...
700       39
699       39
698       39
695       39
1870      39

[1871 rows x 1 columns]

In [50]:
first = df[df['cfips'] == 1001]

first[['microbusiness_density', 'year']].corr()

                       microbusiness_density      year
microbusiness_density               1.000000  0.852428
year                                0.852428  1.000000

In [55]:
first['microbusiness_density'].pct_change().head(10)

0         NaN
1   -0.040833
2    0.059265
3   -0.020489
4    0.000000
5   -0.008066
6   -0.020129
7    0.008217
8    0.022820
9    0.001594
Name: microbusiness_density, dtype: float64

In [57]:
first['microbusiness_density'].pct_change().head(10).fillna(0)

0    0.000000
1   -0.040833
2    0.059265
3   -0.020489
4    0.000000
5   -0.008066
6   -0.020129
7    0.008217
8    0.022820
9    0.001594
Name: microbusiness_density, dtype: float64

In [78]:
first['cumsum'] = first['microbusiness_density'].cumsum()

s = 1 - first['microbusiness_density'] / first['microbusiness_density'].shift(1)

s.head(10)

0         NaN
1    0.040833
2   -0.059265
3    0.020489
4    0.000000
5    0.008066
6    0.020129
7   -0.008217
8   -0.022820
9   -0.001594
Name: microbusiness_density, dtype: float64

In [65]:
import numpy as np

first.pivot_table(
    index = 'county',
    columns='year', 
    values='microbusiness_density', 
    aggfunc=np.mean
)

year                2019      2020      2021      2022
county
Autauga County  2.986972  3.044592  3.181585  3.376788

## Handling Missing Values